Config/Documents/НачислениеДоходовБудущихПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеДоходовБудущихПериодов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>InformationRegister.ПараметрыСписанияДоходовБудущихПериодов</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияДБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПризнанияДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПризнанияРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиНУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходовНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяПрочихДоходовНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УслугиИРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСправедливая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСправедливая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДССправедливая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоСправедливая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДБП</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыМежотчетногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМежотчетногоПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаключениеСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехнологическиеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВалютыБаланса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужебныеОперации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыОперацийНачисленияДБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачисленияДБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАрендуНаЛьготныхУсловиях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочныйДоговорОбразование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходыБудущихПериодов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособыПризнанияРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыПризнанияРасходов</Name>
			<Comment>Способы признания расходов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоМесяцам</Name>
					<Comment>Расходы признаются равномерно пропорционально количеству месяцев</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКалендарнымДням</Name>
					<Comment>Расходы признаются равномерно пропорционально количеству календарных дней</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрафику</Name>
					<Comment>Расходы признаются по графику финансирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДатуПризнания</Name>
					<Comment>Доходы признаются на выбранную дату</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОсобомПорядке</Name>
					<Comment>Расходы признаются в особом порядке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/НачислениеДоходовБудущихПериодов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
		
		Если НЕ Объект.Дата = КонецГода(Объект.Дата) И ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода) Тогда
			Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка");
		КонецЕсли;
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса");
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	УслугиИРаботыЗаполнитьДобавленныеКолонки(ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ОтразитьВМежотчетномПериоде", ОтразитьВМежотчетномПериоде);
	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня
	 ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
		УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.Дата = КонецГода(Объект.Дата);
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	Иначе
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	КонецЕсли;
	
	ОтразитьВМежотчетномПериодеПриИзмененииНаСервере();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьВМежотчетномПериодеПриИзмененииНаСервере()
	
	// Может измениться дата определения параметров учетной политики.
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииНаСервере();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	ЭтоПередачаВАренду =
		(Объект.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВАренду);
	ЭтоПередачаВАрендуНаЛьготныхУсловиях =
		(Объект.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях);
	ЭтоПередачаВБезвозмездноеПользование =
		(Объект.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование);
	
	Если ЭтоПередачаВАренду ИЛИ ЭтоПередачаВАрендуНаЛьготныхУсловиях ИЛИ ЭтоПередачаВБезвозмездноеПользование Тогда
		
		Объект.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.ПоМесяцам;
		Объект.СчетДоходовНУ = БухгалтерскийУчет.СчетПоКоду("Н91.01", Объект.Дата);
		
	Иначе
		
		Объект.СчетДоходовНУ = БухгалтерскийУчет.СчетПоКоду("Н90.01", Объект.Дата);
		
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.УслугиИРаботы Цикл
		
		Если ЭтоПередачаВАренду Тогда
			СтрокаТаблицы.ЦенаСправедливая     = СтрокаТаблицы.Цена;
			СтрокаТаблицы.СуммаСправедливая    = СтрокаТаблицы.Сумма;
			СтрокаТаблицы.СуммаНДССправедливая = СтрокаТаблицы.СуммаНДС;
			СтрокаТаблицы.ВсегоСправедливая    = СтрокаТаблицы.Всего;
		ИначеЕсли ЭтоПередачаВБезвозмездноеПользование Тогда
			СтрокаТаблицы.Цена     = 0;
			СтрокаТаблицы.Сумма    = 0;
			СтрокаТаблицы.СуммаНДС = 0;
			СтрокаТаблицы.Всего    = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.СпособПризнанияДоходов.ПараметрыВыбора =
		Перечисления.СпособыПризнанияРасходов.ПараметрыВыбораСпособаПризнанияДоходов(Объект.ВидОперации);
	
	УслугиИРаботыЗаполнитьДобавленныеКолонки(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	ЗапомнитьПараметрыДоговораВКэшеФормы();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КПСПриИзменении(Элемент)
	БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(Объект.КПС, Объект.КЭК); 
КонецПроцедуры

&НаКлиенте
Процедура КЭКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЭтоПередачаВАренду =
		(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияДБП.ПередачаВАренду"));
	ЭтоПередачаВАрендуНаЛьготныхУсловиях =
		(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях"));
	ЭтоПередачаВБезвозмездноеПользование =
		(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование"));
	ЭтоПрочиеДоходы =
		(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияДБП.ПрочиеДоходыБудущихПериодов"));	
	
	Если ЭтоПередачаВАренду ИЛИ ЭтоПередачаВАрендуНаЛьготныхУсловиях ИЛИ ЭтоПередачаВБезвозмездноеПользование Тогда
		ДопустимыеКЭК = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
			"121,122,123", ",");
		ПараметрВыбораКЭК = Новый ПараметрВыбора("Отбор.Код", Новый ФиксированныйМассив(ДопустимыеКЭК));
	ИначеЕсли ЭтоПрочиеДоходы Тогда
		// Устанавливаем отбор по допустимым КОСГУ счета 401.40
		ПараметрВыбораКЭК = Новый ПараметрВыбора("ДополнительныйОтбор.Счет", "401.40");
	Иначе
		ПараметрВыбораКЭК = Новый ПараметрВыбора("Отбор.Код", "000");
	КонецЕсли;
		
	ПараметрыВыбораКЭК = Новый Массив();
	ПараметрыВыбораКЭК.Добавить(ПараметрВыбораКЭК);
	
	Элементы.КЭК.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораКЭК);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьВалютаНДСНажатие(Элемент, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ТипЦены", Объект.ТипЦены);
	
	БухгалтерскийУчетКлиент.ПоказатьФормуВыбораТипаЦеныВалютыНДС(ЭтотОбъект, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ПослеЗакрытияВыбораТипаЦеныВалютыНДС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВыбораТипаЦеныВалютыНДС(Результат, ДополнительныеПараметры) Экспорт

	Если ЭтотОбъект.КэшПараметров.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.Локальные.СуммаВключаетНДС <> Объект.СуммаВключаетНДС Тогда
		ПересчитатьСуммаВключаетНДС();
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	Если ЭтотОбъект.КэшПараметров.Локальные.ТипЦены <> Объект.ТипЦены Тогда
		
		Если Объект.УслугиИРаботы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = НСтр("ru='Табличная часть документа содержит услуги.
								|Пересчитать цены табличной части?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, "Да, пересчитать цены");
		Кнопки.Добавить(КодВозвратаДиалога.Нет, "Нет, не пересчитывать цены");
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Не изменять тип цены");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ТипЦеныПриИзмененииЗавершение", ЭтотОбъект),
			ТекстВопроса, Кнопки,,КодВозвратаДиалога.Отмена);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПересчитатьТипЦены();
		
	Иначе // Восстанавливаем предыдущее значение типа цен.
		
		Объект.ТипЦены = ЭтотОбъект.КэшПараметров.Локальные.ТипЦены;
		УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПризнанияДоходовПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтотОбъект, Объект, "СчетДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовНУПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_УслугиИРаботы

&НаКлиенте
Процедура УслугиИРаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
		УслугиИРаботыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(ТекущиеДанные.Номенклатура,
		Объект.ТипЦены, Объект.Организация, Объект.Дата);
	ТекущиеДанные.Цена = ДанныеНоменклатуры.Цена;
	ТекущиеДанные.ЦенаСправедливая = ТекущиеДанные.Цена;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеНоменклатуры.ЕдиницаИзмерения) Тогда
		ТекущиеДанные.ЕдиницаИзмерения = ДанныеНоменклатуры.ЕдиницаИзмерения;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеНоменклатуры.СтавкаНДС) Тогда
		ТекущиеДанные.СтавкаНДС = ДанныеНоменклатуры.СтавкаНДС;
	КонецЕсли;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Цена");
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "ЦенаСправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	ТекущиеДанные.ЦенаСправедливая = ТекущиеДанные.Цена;
	
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Цена");
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "ЦенаСправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыЦенаСправедливаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "ЦенаСправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	ТекущиеДанные.СуммаСправедливая = ТекущиеДанные.Сумма;
	
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Сумма");
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаСправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыСуммаСправедливаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаСправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыСуммаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	ТекущиеДанные.СуммаНДССправедливая = ТекущиеДанные.СуммаНДС;
	
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДС");
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДССправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыСуммаНДССправедливаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДССправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыВсегоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	ТекущиеДанные.ВсегоСправедливая = ТекущиеДанные.Всего;
	
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Всего");
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "ВсегоСправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыВсегоСправедливаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "ВсегоСправедливая");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИРаботыСчетДБППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиИРаботы.ТекущиеДанные;
	
	ТекущиеДанные.ЕстьКодЦели = БухгалтерскийУчетВызовСервераПовтИсп.ЕстьСубконтоСчета(ТекущиеДанные.СчетДБП,
		ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ВидыЦелевыхСредств"));
	
	Если Не ТекущиеДанные.ЕстьКодЦели Тогда
		ТекущиеДанные.КодЦели = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УслугиИРаботыЗаполнитьДобавленныеКолонки(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.УслугиИРаботы Цикл
		
		ТекущаяСтрока.ЕстьКодЦели = БухгалтерскийУчетВызовСервераПовтИсп.ЕстьСубконтоСчета(ТекущаяСтрока.СчетДБП,
			ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ВидыЦелевыхСредств"));
		
		УслугиИРаботыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ТекущаяСтрока);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УслугиИРаботыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ТекущаяСтрока)
	
	ТекущаяСтрока.ЗаголовокСтоимостьПоДоговору   = НСтр("ru = 'Сумма по договору:'");
	ТекущаяСтрока.ЗаголовокСтоимостьСправедливая = НСтр("ru = 'Справедливая стоимость:'");
	
	Если БухгалтерскийУчетКлиентСервер.МодульЧисла(ТекущаяСтрока.ВсегоСправедливая) > 
			БухгалтерскийУчетКлиентСервер.МодульЧисла(ТекущаяСтрока.Всего) Тогда
		ТекущаяСтрока.УпущеннаяВыгода = Формат(ТекущаяСтрока.ВсегоСправедливая - ТекущаяСтрока.Всего, "ЧЦ=12; ЧДЦ=2");
	Иначе
		ТекущаяСтрока.УпущеннаяВыгода = НСтр("ru = 'Отсутствует'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборУслуг(Команда)
	
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериалов(ЭтаФорма, Объект,, ДополнитьСтруктуруПодбора());
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиГрафикПризнанияДоходов(Команда)
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("ДокументОснование", Объект.Ссылка);
	ПараметрыВызова.Вставить("Организация", Объект.Организация);
	ПараметрыВызова.Вставить("ИФО", Объект.ИФО);
	ПараметрыВызова.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыВызова.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	
	КонтрольИсполненияДоговоровКлиент.ВвестиИзменитьГрафикПоДоговору(Объект.Договор, "ПланГрафикИсполнения",
		ПараметрыВызова, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГрафикПризнанияДоходов(Команда)
	
	КонтрольИсполненияДоговоровКлиент.ОткрытьГрафикИсполненияДоговора(
		Объект.Договор, , , ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗапомнитьПараметрыДоговораВКэшеФормы();
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	УслугиИРаботыЗаполнитьДобавленныеКолонки(ЭтотОбъект);
	
	Элементы.СпособПризнанияДоходов.ПараметрыВыбора =
		Перечисления.СпособыПризнанияРасходов.ПараметрыВыбораСпособаПризнанияДоходов(Объект.ВидОперации);
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтотОбъект, Объект, "СчетДоходов");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоПередачаВАрендуПользование =
		(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияДБП.ПередачаВАренду")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование"));
	
	ЭлементыАмортизации = Новый Массив;
	ЭлементыАмортизации.Добавить("УслугиИРаботыСтоимостьАрендыЗаголовки");
	ЭлементыАмортизации.Добавить("УслугиИРаботыЦенаСправедливая");
	ЭлементыАмортизации.Добавить("УслугиИРаботыСуммаСправедливая");
	ЭлементыАмортизации.Добавить("УслугиИРаботыСтавкаНДССправедливая");
	ЭлементыАмортизации.Добавить("УслугиИРаботыСуммаНДССправедливая");
	ЭлементыАмортизации.Добавить("УслугиИРаботыВсегоСправедливая");
	ЭлементыАмортизации.Добавить("УслугиИРаботыУпущеннаяВыгода");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыАмортизации, "Видимость", ЭтоПередачаВАрендуПользование);
	
	ЭтоПередачаВАрендуНаЛьготныхУсловиях = (Объект.ВидОперации = ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях"));
	
	ОсобыйПорядокПризнанияДоходовТекущегоПериода =
		(Объект.СпособПризнанияДоходов = ПредопределенноеЗначение("Перечисление.СпособыПризнанияРасходов.ВОсобомПорядке"));
	ПризнаниеДоходовТекущегоПериодаПоГрафику =
		(Объект.СпособПризнанияДоходов = ПредопределенноеЗначение("Перечисление.СпособыПризнанияРасходов.ПоГрафику"));
	
	ВедетсяГрафикПоДоговору = Форма.КэшПараметров.Локальные.Свойство("ВедетсяГрафикПоДоговору")
		И Форма.КэшПараметров.Локальные.ВедетсяГрафикПоДоговору;
	ЕстьГрафикПоДоговору = Форма.КэшПараметров.Локальные.Свойство("ЕстьГрафикПоДоговору")
		И Форма.КэшПараметров.Локальные.ЕстьГрафикПоДоговору;
	
	СрокСписания = Новый Массив;
	СрокСписания.Добавить("ДатаНачалаСписания");
	СрокСписания.Добавить("ДатаОкончанияСписания");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		СрокСписания, "Видимость", НЕ ПризнаниеДоходовТекущегоПериодаПоГрафику ИЛИ ЭтоПередачаВАрендуНаЛьготныхУсловиях);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрафикПризнанияДоходов",
		"Видимость", ПризнаниеДоходовТекущегоПериодаПоГрафику И ВедетсяГрафикПоДоговору);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрафикПризнанияДоходовПредупреждение",
		"Видимость", ПризнаниеДоходовТекущегоПериодаПоГрафику И НЕ ВедетсяГрафикПоДоговору);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ВвестиГрафикПризнанияДоходов", "Видимость", ПризнаниеДоходовТекущегоПериодаПоГрафику И НЕ ЕстьГрафикПоДоговору);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьГрафикПризнанияДоходов", "Видимость", ПризнаниеДоходовТекущегоПериодаПоГрафику И ЕстьГрафикПоДоговору);
	
	Если ОсобыйПорядокПризнанияДоходовТекущегоПериода Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "АвтоОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "ОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "АвтоОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "ОтметкаНезаполненного", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "АвтоОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "ОтметкаНезаполненного", Не ЗначениеЗаполнено(Объект.ДатаНачалаСписания));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "АвтоОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "ОтметкаНезаполненного", Не ЗначениеЗаполнено(Объект.ДатаОкончанияСписания));
	КонецЕсли;
	
	Если ПризнаниеДоходовТекущегоПериодаПоГрафику Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'Доходы будущих периодов относятся на финансовый результат текущего периода согласно графику, установленному договором.'"));
	ИначеЕсли ОсобыйПорядокПризнанияДоходовТекущегоПериода Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'Суммы списания доходов будущих периодов указываются вручную в регламентном документе ""Списание доходов будущих периодов"".'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'В течение указанного срока доходы будущих периодов относятся на финансовый результат текущего периода.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовНалоговогоУчета(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоПередачаВБезвозмездноеПользование =
		(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование"));
	
	ОтражатьВНалоговомУчете = НалоговыйУчетКлиентСервер.ВедетсяНалоговыйУчетПоКФО(Объект.КФО)
		И Форма.КэшПараметров.УчетнаяПолитика.ПлательщикНалогаНаПрибыль
		И НЕ ЭтоПередачаВБезвозмездноеПользование;
	ОтражатьВНалоговомУчетеУСН = УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(Объект.КФО)
		И (Форма.КэшПараметров.УчетнаяПолитика.ПрименяетсяУСНДоходы
		ИЛИ Форма.КэшПараметров.УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы)
		И НЕ ЭтоПередачаВБезвозмездноеПользование;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНалоговыйУчет", "Видимость", ОтражатьВНалоговомУчете ИЛИ ОтражатьВНалоговомУчетеУСН);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаБухгалтерскийУчет", "ОтображатьЗаголовок", ОтражатьВНалоговомУчете ИЛИ ОтражатьВНалоговомУчетеУСН);
	
	ЭтоПрочиеДоходы = БухгалтерскийУчетКлиентСервер.СчетВИерархии(Объект.СчетДоходовНУ, "Н91.01");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтатьяПрочихДоходовНУ", "Видимость", ЗначениеЗаполнено(Объект.СчетДоходовНУ) И ЭтоПрочиеДоходы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Доступность и оформление сумм в зависимости от вида операции.
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыЦенаСправедливая");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыСуммаСправедливая");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыСуммаНДССправедливая");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыВсегоСправедливая");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ВидОперации", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.ВидыОперацийНачисленияДБП.ПередачаВАренду);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыЦена");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыСумма");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыСуммаНДС");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыВсего");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ВидОперации", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Отсутствует'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	// Доступность поля КодЦели в зависимости от настроек счета ДБП (401.4Х).
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиИРаботыКодЦели");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.УслугиИРаботы.ЕстьКодЦели", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьПараметрыДоговораВКэшеФормы()
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВедетсяГрафикПоДоговору", Ложь);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ЕстьГрафикПоДоговору", Ложь);
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ВестиПланГрафикИсполнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВестиПланГрафикИсполнения");
		ЭтотОбъект.КэшПараметров.Локальные.ВедетсяГрафикПоДоговору = 
			?(ВестиПланГрафикИсполнения = Неопределено, Ложь, ВестиПланГрафикИсполнения);
		ЭтотОбъект.КэшПараметров.Локальные.ЕстьГрафикПоДоговору = 
			КонтрольИсполненияДоговоров.ЕстьГрафикПоДоговору(Объект.Договор, "ПланГрафикИсполнения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммаВключаетНДС()

	Для каждого ТекУслуга Из Объект.УслугиИРаботы Цикл
	
		РасчитатьСтроку(ТекУслуга, Объект.СуммаВключаетНДС, "Сумма");
		РасчитатьСтроку(ТекУслуга, Объект.СуммаВключаетНДС, "СуммаСправедливая");
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьТипЦены()

	МассивНоменклатуры = Объект.УслугиИРаботы.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	ЦеныНоменклатуры = ПолучитьЦенуНоменклатуры(МассивНоменклатуры, Объект.ТипЦены, Объект.Организация, Объект.Дата);
	Для каждого ТекущиеДанные Из Объект.УслугиИРаботы Цикл
	
		СтрЦена = ЦеныНоменклатуры.Найти(ТекущиеДанные.Номенклатура, "Номенклатура");
		Если СтрЦена <> Неопределено Тогда
			ТекущиеДанные.Цена = СтрЦена.Цена;
		Иначе
			ТекущиеДанные.Цена = 0;
		КонецЕсли;
		РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Цена");
	
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ТипЦены, Организация, Дата)

	МассивНоменклатуры = ТипЗнч(Номенклатура) = Тип("Массив");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ТипЦен = &ТипЦены
	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	Если МассивНоменклатуры Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура = &Номенклатура", "Номенклатура В (&Номенклатура)");
	КонецЕсли;
	Запрос.УстановитьПараметр("Период",			Дата); 
	Запрос.УстановитьПараметр("Организация",	Организация); 
	Запрос.УстановитьПараметр("ТипЦены",		ТипЦены); 
	Запрос.УстановитьПараметр("Номенклатура",	Номенклатура); 
	Результат = Запрос.Выполнить();
	Если МассивНоменклатуры Тогда
		Возврат Результат.Выгрузить();
	Иначе
		Если Результат.Пустой() Тогда
			Возврат 0;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Цена;
		КонецЕсли;
	КонецЕсли;

КонецФункции
 
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатуры(Номенклатура, ТипЦены, Организация, Дата)

	СтруктураДанных = Новый Структура("ЕдиницаИзмерения,СтавкаНДС");
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, СтруктураДанных);
	ДанныеНоменклатуры.Вставить("Цена", ПолучитьЦенуНоменклатуры(Номенклатура, ТипЦены, Организация, Дата));
	Возврат ДанныеНоменклатуры;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
	ПараметрыРасчета.Вставить("РассчитыватьЦену", Истина);
	
	ЭтоРеквизитГруппыСправедливаяСтоимость = (СтрНайти(ВРЕГ(ИмяРеквизита), "СПРАВЕДЛИВАЯ") <> 0);
	
	Если НЕ ЭтоРеквизитГруппыСправедливаяСтоимость Тогда
		
		// Расчет реквизитов "Цена", "Сумма", "СуммаНДС", "Всего".
		УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
		
	КонецЕсли;
	
	Если ЭтоРеквизитГруппыСправедливаяСтоимость ИЛИ ИмяРеквизита = "Количество" ИЛИ ИмяРеквизита = "СтавкаНДС" Тогда
		
		// Расчет реквизитов "ЦенаСправедливая", "СуммаСправедливая", "СуммаНДССправедливая", "ВсегоСправедливая".
		ПараметрыРасчета.Вставить("ИмяРеквизитаЦена",     "ЦенаСправедливая");
		ПараметрыРасчета.Вставить("ИмяРеквизитаСумма",    "СуммаСправедливая");
		ПараметрыРасчета.Вставить("ИмяРеквизитаСуммаНДС", "СуммаНДССправедливая");
		ПараметрыРасчета.Вставить("ИмяРеквизитаВсего",    "ВсегоСправедливая");
		УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ,
			СтрЗаменить(ВРЕГ(ИмяРеквизита), "СПРАВЕДЛИВАЯ", ""), ПараметрыРасчета);
		
	КонецЕсли;
	
	УслугиИРаботыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(СтрокаТЧ);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПодразделения(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Подразделение",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Договор",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация) И ЗначениеЗаполнено(Форма.Объект.Контрагент));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Объект, ИмяРеквизитаСчет)
	Перем МассивПолей;
	
	Если ИмяРеквизитаСчет = "СчетДоходов" Тогда
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто1", "СубконтоДоходов1", "СубконтоДоходов1", Истина, "СубконтоДоходов1", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто2", "СубконтоДоходов2", "СубконтоДоходов2", Истина, "СубконтоДоходов2", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто3", "СубконтоДоходов3", "СубконтоДоходов3", Истина, "СубконтоДоходов3", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Объект.СчетДоходов, Форма, Объект, МассивПолей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()

	ПараметрыПодбора = Новый Структура;
	
	ЗаголовокПодбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Подбор услуг/работ в %1 (%2)'"),Объект.Ссылка,"Услуги");
	
	ПараметрыПодбора.Вставить("Заголовок", ЗаголовокПодбора);

	ПараметрыПодбора.Вставить("Подразделение",Объект.Подразделение);
	
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Госуслуга"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.УслугиАренды"));

	ПараметрыПодбора.Вставить("ТипыНоменклатуры",ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("Валюта",Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("ЕстьЦена",Истина);
	ПараметрыПодбора.Вставить("ВыводитьНулевуюНоменклатуру",Истина);
	ПараметрыПодбора.Вставить("ИмяТаблицы","УслугиИРаботы");
	ПараметрыПодбора.Вставить("ПоказыватьЦены",Истина);
	ПараметрыПодбора.Вставить("ТипЦен",Объект.ТипЦены);
	
	Возврат ПараметрыПодбора; 

КонецФункции

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	
	СписокПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	Для Каждого ЭлементПодбора Из СписокПодбора Цикл
		НоваяСтрока = Объект.УслугиИРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементПодбора);
		НоваяСтрока.ЦенаСправедливая = НоваяСтрока.Цена;
		НоваяСтрока.СуммаСправедливая = НоваяСтрока.Сумма;
		РасчитатьСтроку(НоваяСтрока, Объект.СуммаВключаетНДС, "Сумма");
		РасчитатьСтроку(НоваяСтрока, Объект.СуммаВключаетНДС, "СуммаСправедливая");
		УслугиИРаботыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтавкиНДСизНоменклатуры()

	Для каждого ТекСтр Из Объект.УслугиИРаботы Цикл
		
		СтавкаНДСНоменклатуры =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтр.Номенклатура, "СтавкаНДС");
		Если ЗначениеЗаполнено(СтавкаНДСНоменклатуры) Тогда
			ТекСтр.СтавкаНДС = СтавкаНДСНоменклатуры;
			РасчитатьСтроку(ТекСтр, Объект.СуммаВключаетНДС, "Цена");
			РасчитатьСтроку(ТекСтр, Объект.СуммаВключаетНДС, "ЦенаСправедливая");
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСтрокиЦенаНДСВалюта(Форма)

	Объект = Форма.Объект;
	
	ПараметрыПредставления = Новый Структура("ТипЦены, ВалютаДокумента, СуммаВключаетНДС");
	ЗаполнитьЗначенияСвойств(ПараметрыПредставления, Объект);
	ПараметрыПредставления.Вставить("ПоказыватьТипЦены", Истина);
	ПараметрыПредставления.Вставить("ПоказыватьНДС", Истина);
	ПараметрыПредставления.Вставить("ПоказыватьВалюту", Форма.КэшПараметров.ИспользоватьВалютныйУчет);
	
	Форма.НадписьВалютаНДС = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта(
		ПараметрыПредставления);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтавкиНДССтрокИзНоменклатуры(Результат, ДополнительныеПараметры) Экспорт

	ИзменитьСтавкиНДСизНоменклатуры();

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
